[
    {
        "date": "1-18-2024",
        "title": "How to Enroll in Medicare",
        "author": "The Medicare Broker",
        "summary": "Here is where the summary will go. This is complete filler text nonse that is meant to fill the space so you can see what an actual summary may look like when presented at this size.",
        "body": "<p><span style=\"font-size:16pt;\">Enrollment in Medicare for Parts A and B is done through three main avenues. After explaining enrollment in Parts A and B we will include the enrollment process for Advantage and Supplement plans.&nbsp;</span></p><p><br></p><p><strong><span style=\"font-size:16pt;\">Online:</span></strong><span style=\"font-size:16pt;\">&nbsp;</span></p><p><span style=\"font-size:16pt;\">You can apply online through the Social Security Administration&apos;s website. For this you will want to have a Social Security account. If you don&rsquo;t currently have a Social Security account you can make one by going to https://www.ssa.gov/onlineservices/ and selecting &ldquo;Create an Account&rdquo;. This is typically the fastest and easiest way to apply.</span></p><p><span style=\"font-size:16pt;\"><span style=\"border:none;\"><img src=\"https://lh7-us.googleusercontent.com/iMj4tcbpTX8DwpEvTJhAJUDLLQ6uEsoILq158qJ6fZAvHVhUxolL9BGH0RY_9eCFaYC0iZcxhOseLjv_Ie4K_xgUav2Oet35qgw_u9k_Mj8-4s8HGuCoBlTzH5iDTRoizgCNB6_8vuTKZW5ltethag\" width=\"624\" height=\"332\"></span></span></p><p><br></p><p><strong><span style=\"font-size:16pt;\">By Phone:</span></strong><span style=\"font-size:16pt;\">&nbsp;</span></p><p><span style=\"font-size:16pt;\">You can call Social Security at 1-800-772-1213 from 7 a.m. to 7 p.m. Monday through Friday. If you are deaf or hard of hearing, you can call TTY 1-800-325-0778. They tend to pick up faster in the morning but often take between 40 minutes to an hour.</span></p><p><br></p><p><strong><span style=\"font-size:16pt;\">In-Person:&nbsp;</span></strong></p><p><span style=\"font-size:16pt;\">You can visit your local Social Security office to apply in person. It is recommended to make an appointment ahead of time to avoid long waits.</span></p><p><br></p><p><span style=\"font-size:16pt;\"><span style=\"border:none;\"><img src=\"https://lh7-us.googleusercontent.com/XMZSRQY3lKFIs3BDjRT_qmeBF7UG5toQVVwMJxCwOH_kFuhM5gdPADzI1S2YvgaIO-4z-a05dFc9hkDVhFOlT0Rit-6qU6fAfIKdSEofy4G2b3ECM70O_YaHK6nUbHaFHhL4iqpHSz0AJ35TOprMHQ\" width=\"600\" height=\"447\"></span></span></p><p><br></p><p><span style=\"font-size:16pt;\">In most cases, you should sign up for Medicare three months before your 65th birthday, even if you are not ready to retire. It is advised to consult with a licensed medicare agent to decide if it is beneficial to move onto Medicare before retiring (especially if you have a spouse on your employer plan who is not yet eligible for Medicare). The initial enrollment period begins three months before your 65th birthday and extends for three months after.</span></p><p><br></p><p><span style=\"font-size:16pt;\">If you or your spouse are still working and you have health insurance through that employer or union, you may qualify for a Special Enrollment Period (SEP), which allows you to sign up for Medicare Part B without a late enrollment penalty.</span></p><p><br></p><p><span style=\"font-size:16pt;\">You will need your Social Security number and some additional documentation to apply. This may include proof of citizenship or residency status, a record of your earnings (W-2 or self-employment tax return), and military discharge papers if you served before 1968.</span></p><p><br></p><p><span style=\"font-size:16pt;\">If you are already receiving Social Security benefits you will be automatically enrolled in Medicare Parts A and B when you turn 65, and you will receive your Medicare card in the mail.&nbsp;</span></p><p><br></p><p><span style=\"font-size:16pt;\">Remember, it&apos;s important to sign up for Medicare during your initial enrollment period. If you don&apos;t have creditable coverage through an employer, you may have to pay a late enrollment penalty for as long as you have Medicare.</span></p><p><br></p><p><span style=\"font-size:16pt;\">Once you have signed up for Parts A and B you can then sign up for a Medicare Advantage or Medicare Supplement plan. This process affords you more options on how you decide to enroll. You can research a plan and enroll yourself on Medicare.gov. Another option is to find a Medicare Enrollment center who doesn&rsquo;t charge any fee for their services. Our enrollment center is located at 5802 Blackshire Path, Inver Grove Heights Minnesota 55077.&nbsp;</span></p>",
        "link": "how-do-I-enroll-in-medicare",
        "image": "resources/images/articles/EnrollInMedicare.png",
        "isHighlighted": "yes"
    },
    {
        "date": "Date here (month-day-year format)",
        "title": "Article here",
        "author": "Author here",
        "summary": "Summary here",
        "body": "Body here",
        "link": "link-for-article-here",
        "image": "resources/images/articles/exampleArticleImage.png",
        "isHighlighted": "yes"
    },
    {
        "date": "Date here (month-day-year format)2",
        "title": "Article here2",
        "author": "Author here2",
        "summary": "Summary here2",
        "body": "Body here2",
        "link": "link-for-article-here-2",
        "image": "resources/images/articles/exampleArticleImage.png",
        "isHighlighted": "no"
    }
]

